app/controllers/users_controller.rb

SELECT  "microsposts".* FROM "microsposts"   ORDER BY "microsposts"."id" ASC LIMIT 1
---
  def show
    @microsposts = Microspost.all

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-12-12 11:13:37.663422"], ["email", "abdallah@orange.sn"], ["name", "Mame Abdou"], ["updated_at", "2014-12-12 11:13:37.663422"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save